# GetWorksetIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredWorksetCollector..::..GetWorksetIterator Method
FilteredWorksetCollector Class See Also
---
Returns a FilteredWorksetIterator to the worksets passing the current filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public FilteredWorksetIterator GetWorksetIterator()
```

Visual Basic
---
```text
Public Function GetWorksetIterator As FilteredWorksetIterator
```

Visual C++
---
```text
public:
FilteredWorksetIterator^ GetWorksetIterator()
```

# Remarks
Calling this when you have an active iterator to this same collector will result in the first iterator being stopped by this call.
# See Also
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace